
numbers = {
    'نومدسیلیون': 10 ** 60, 'اُکتودسیلیون': 10 ** 57, 'سپتدسیلیون': 10 ** 54,
    'سیکسدسیلیون': 10 ** 51, 'کویندسیلیون': 10 ** 48,
    'کواتیوردسیلیون': 10 ** 45, 'تریدسیلیون': 10 ** 42, 'دیودسیلیون': 10 ** 39,
    'آندسیلیون': 10 ** 36, 'دسیلیون': 10 ** 33, 'نانیلیون': 10 ** 30,
    'اکتیلیون': 10 ** 27, 'سپتیلیون': 10 ** 24, 'سیکستیلیون': 10 ** 21,
    'کوینتیلیون': 10 ** 18, 'کوادریلیون': 10 ** 15, 'تریلیون': 10 ** 12,
    'میلیارد': 10 ** 9, 'میلیون': 10 ** 6, 'هزار': 10 ** 3,
}

yekan = {
    'نه': 9, 'هشت': 8, 'هفت': 7, 'شش': 6, 'پنج': 5, 'چهار': 4, 'سه': 3,
    'دو': 2, 'یک': 1,
}

dahgan = {
    'نود': 90, 'هشتاد': 80, 'هفتاد': 70, 'شصت': 60, 'پنجاه': 50, 'چهل': 40,
    'سی': 30, 'بیست': 20, 'ده': 10,
}

yk_dg_combine = {
    'یازده': 11, 'دوازده': 12, 'سیزده': 13, 'چهارده': 14, 'پانزده': 15,
    'شانزده': 16, 'هفده': 17, 'هجده': 18, 'نوزده': 19
}

sadgan = {
    'نه صد': 900, 'هشتصد': 800, 'هفتصد': 700, 'ششصد': 600, 'پانصد': 500,
    'چهارصد': 400, 'سیصد': 300, 'دویست': 200, 'صد': 100,
}
